MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
/**
  ******************************************************************************
  * @file    stm32c5xx_hal_comp.c
  * @brief   COMP HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the COMP (analog comparator) peripheral:
  *           + Initialization and de-initialization functions
  *           + IO operation functions
  *           + Peripheral state and errors functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32_hal.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined(COMP1) || defined(COMP2)
#if defined(USE_HAL_COMP_MODULE) && (USE_HAL_COMP_MODULE == 1)

/** @addtogroup COMP
  * @{
  */
/** @defgroup COMP_Introduction COMP Introduction
  * @{

  - The COMP (analog comparator) hardware abstraction layer provides a set of APIs to interface with the
    STM32 COMP peripheral.
  - It simplifies the initialization, configuration and process of peripheral features.
  - This abstraction layer ensures portability and ease of use across different STM32 series.

  The HAL COMP driver includes the following features:
   - process in background (no notification) or interrupt mode
   - window mode (combine 2 comparator instances)

  */
/**
  * @}
  */

/** @defgroup COMP_How_To_Use COMP How To Use
  * @{

# How to use the COMP (analog comparator) HAL module driver

## HAL COMP driver usage

- COMP configuration :
  - System configuration (out of HAL COMP driver).
    - RCC to provide COMP kernel clock.
    - GPIO to connect comparator inputs and output to device pins.
    - CPU Cortex NVIC to configure interrupts lines (if COMP usage with interrupt).
  - COMP peripheral configuration.
    - COMP peripheral is structured in subblocks with each a specific scope.
      HAL COMP follows this structure with a configuration structure and associated function for each subblock.
        - COMP instance subblock:
          - basic configuration (prefix HAL_COMP).
          - output blanking from signal of other peripheral (typically: timer) (optional).
        - COMP multi-instances subblocks:
          - window mode (prefix HAL_COMP_WINDOW): combine multiple COMP instances for voltage comparison
            to 2 thresholds.
    - COMP instances can belong to a COMP common instance, in this case they can share features (window mode,
      other shared features, ...). HAL COMP driver provides a mechanism to link HAL COMP handles
      and manage shared features.
  - HAL COMP configuration steps:
    1. Configure system.
    2. Initialize HAL COMP handle using HAL_COMP_Init().
    3. Case of multiple COMP instances used: Link HAL COMP handles using HAL_COMP_WINDOW_SetHandle().
       (for more details, refer to function description).
    4. Configure comparator using functions HAL_COMP_[WINDOW]_SetConfig{Features}()
       and optional features with unitary functions HAL_COMP_[WINDOW]_Set{Features}()

- COMP operation
  - Activation and deactivation :
    - COMP peripheral requires a specific procedure for activation (internal analog circuitry control, delay for
      stabilization time).
      Note: From activation step, COMP internal analog hardware is enabled, inducing current consumption.
            Therefore, after COMP usage, COMP must be deactivated for power optimization.
  - COMP analog comparison management :
    - Comparisons can be performed using two programming models:
      - Background operation (for system wake up, asynchronous read of comparator output, comparator output on GPIO:
        using HAL_COMP_[WINDOW]_Start()
      - Interrupt mode: using HAL_COMP_[WINDOW]_StartConv_IT(), HAL_COMP_IRQHandler() and callback functions.
  - HAL COMP operation steps:
    1. Activate and start COMP comparison using functions HAL_COMP_[WINDOW]_Start...().
       Optionally, lock comparator using function HAL_COMP_[WINDOW]_Lock(): for safety purpose, comparator
       configuration frozen until system reset.
    2. Process comparison using HAL_COMP_[WINDOW]_GetOutputLevel(), IRQ handler and callback functions
    3. Deactivate and stop COMP comparison using functions HAL_COMP_[WINDOW]_Stop...() (if not locked).

## Callback registration
When the compilation flag USE_HAL_COMP_REGISTER_CALLBACKS is set to 1,
functions HAL_COMP_Register...Callback() allow registering following callbacks:
  - @ref HAL_COMP_OutputTriggerCallback() : COMP output trigger callback

When the compilation flag USE_HAL_COMP_REGISTER_CALLBACKS is set to 0 or not defined,
the callback registration feature is not available and all callbacks are set to the corresponding weak functions.
  */
/**
  * @}
  */

/** @defgroup COMP_Configuration_Table COMP Configuration Table
  * @{
## Configuration inside the COMP driver

Config defines                  | Description           | Default value | Note
------------------------------- | --------------------- | ------------- | --------------------------------------------
USE_HAL_COMP_MODULE             | from hal_conf.h       | 1  | When set, HAL COMP module is enabled.
USE_HAL_COMP_EXTI               | from hal_conf.h       | 1  | When set, HAL COMP can be used with EXTI.
.                               |                       |    | (needed for event and IT operation).
USE_HAL_COMP_WINDOW_MODE        | from hal_conf.h       | 0  | When set, HAL COMP common features are available (under
.                               |                       |    | condition of feature supported: COMP_WINDOW_MODE_SUPPORT)
USE_HAL_COMP_REGISTER_CALLBACKS | from hal_conf.h       | 0  | When defined, enable the register callbacks assert.
USE_HAL_COMP_CLK_ENABLE_MODEL   | from hal_conf.h       | HAL_CLK_ENABLE_NO | Enable gating of the peripheral clock.
USE_HAL_CHECK_PARAM             | from hal_conf.h       | 0  | Parameters (pointers or sizes) are checked in runtime.
USE_HAL_CHECK_PROCESS_STATE     | from hal_conf.h       | 0  | When set, enable atomic access to process state check.
USE_ASSERT_DBG_PARAM            | from PreProcessor env | None | When defined, enable the params assert.
USE_ASSERT_DBG_STATE            | from PreProcessor env | None | When defined, enable the state assert.
COMP_WINDOW_MODE_SUPPORT        | from DFP | None  | When defined, COMP window mode features available.
  */
/**
  * @}
  */

/* Private constants ---------------------------------------------------------*/
/** @defgroup COMP_Private_Constants COMP Private Constants
  * @{
  */

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
/*! Comparator EXTI Lines associated to comparator instances */
#define EXTI_COMP1                      (LL_EXTI_LINE_34)  /*!< EXTI line connected to comparator output: COMP1 */
#if defined(COMP2)
#define EXTI_COMP2                      (LL_EXTI_LINE_36)  /*!< EXTI line connected to comparator output: COMP2 */
#endif /* COMP2 */
#endif /* USE_HAL_COMP_EXTI */

/**
  * @}
  */

/* Private macros -------------------------------------------------------------*/
/** @defgroup COMP_Private_Macros COMP Private Macros
  * @{
  */

/*! Get COMP instance from the selected HAL COMP handle */
#define COMP_GET_INSTANCE(hcomp) ((COMP_TypeDef *)((uint32_t)(hcomp)->instance))

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
/*! Get the EXTI line associated to a comparator instance */
#if defined(COMP2)
#define COMP_GET_EXTI_LINE(instance)    (((instance) == HAL_COMP1) ? EXTI_COMP1 : EXTI_COMP2)
#else
#define COMP_GET_EXTI_LINE(instance)    EXTI_COMP1
#endif /* COMP3 && COMP4 */
#endif /* USE_HAL_COMP_EXTI */

/**
  * @brief Wait for approximate delay in us.
  * @param delay_us Delay to wait for (unit: us).
  * @note  Compute number of CPU cycles to wait for, using CMSIS global variable "SystemCoreClock".
  * @note  Delay is approximate (depends on compilation optimization).
  * @note  Computation: variable is divided by 2 to compensate partially CPU processing cycles of wait loop
  *        (total shift right of 21 bits, including conversion from frequency in MHz).
  *        If system core clock frequency is below 500kHz, delay is fulfilled by few CPU processing cycles.
  */
#define COMP_DELAY_US(delay_us)                                                        \
  do {                                                                                 \
    volatile uint32_t wait_loop_index = ((delay_us * (SystemCoreClock >> 19U)) >> 2U); \
    while (wait_loop_index != 0UL) {                                                   \
      wait_loop_index--;                                                               \
    }                                                                                  \
  } while(0)

/**
  * @brief IS_COMP macro assert definitions
  * @{
  */
/*! Assert definitions of comparator power mode */
#define IS_COMP_POWER_MODE(power_mode) (((power_mode) == HAL_COMP_POWER_MODE_HIGH_SPEED) \
                                        || ((power_mode) == HAL_COMP_POWER_MODE_MEDIUM_SPEED) \
                                        || ((power_mode) == HAL_COMP_POWER_MODE_ULTRA_LOW_POWER))

/*! Assert definitions of comparator input plus */
#if defined(COMP2)
#define IS_COMP_INPUT_PLUS(instance, input_plus) (((input_plus) == HAL_COMP_INPUT_PLUS_IO1) \
                                                  || ((input_plus) == HAL_COMP_INPUT_PLUS_IO2) \
                                                  || ((input_plus) == HAL_COMP_INPUT_PLUS_IO3) \
                                                  || ((input_plus) == HAL_COMP_INPUT_PLUS_DAC1_CH1) \
                                                  || ((input_plus) == HAL_COMP_INPUT_PLUS_DAC1_CH2))
#else
#define IS_COMP_INPUT_PLUS(instance, input_plus) (((input_plus) == HAL_COMP_INPUT_PLUS_IO1) \
                                                  || ((input_plus) == HAL_COMP_INPUT_PLUS_IO2) \
                                                  || ((input_plus) == HAL_COMP_INPUT_PLUS_IO3) \
                                                  || ((input_plus) == HAL_COMP_INPUT_PLUS_DAC1_CH1))
#endif /* COMP2 */

/*! Assert definitions of comparator input minus */
#if defined(COMP2)
#define IS_COMP_INPUT_MINUS(instance, input_minus) (((input_minus) == HAL_COMP_INPUT_MINUS_VREFINT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_1_2VREFINT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_1_4VREFINT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_3_4VREFINT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_IO1) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_IO2) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_IO3) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_DAC1_CH1) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_DAC1_CH2) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_OPAMP1_OUT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_TEMPSENSOR))
#else
#define IS_COMP_INPUT_MINUS(instance, input_minus) (((input_minus) == HAL_COMP_INPUT_MINUS_VREFINT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_1_2VREFINT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_1_4VREFINT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_3_4VREFINT) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_IO1) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_IO2) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_IO3) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_DAC1_CH1) \
                                                    || ((input_minus) == HAL_COMP_INPUT_MINUS_TEMPSENSOR))
#endif /* COMP2 */

/*! Assert definitions of comparator input hysteresis */
#define IS_COMP_INPUT_HYSTERESIS(input_hysteresis) (((input_hysteresis) == HAL_COMP_INPUT_HYSTERESIS_NONE) \
                                                    || ((input_hysteresis) == HAL_COMP_INPUT_HYSTERESIS_LOW) \
                                                    || ((input_hysteresis) == HAL_COMP_INPUT_HYSTERESIS_MEDIUM) \
                                                    || ((input_hysteresis) == HAL_COMP_INPUT_HYSTERESIS_HIGH))

