MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
/*! Assert definitions of comparator output polarity */
#define IS_COMP_OUTPUT_POLARITY(output_polarity) (((output_polarity) == HAL_COMP_OUTPUT_POLARITY_NONINVERTED) \
                                                  || ((output_polarity) == HAL_COMP_OUTPUT_POLARITY_INVERTED))

/*! Assert definitions for comparator output blanking (specific to COMP1). */
#define IS_COMP_OUTPUT_BLANK_COMP1(output_blank) (((output_blank) == HAL_COMP_OUTPUT_BLANK_NONE) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM1_OC5) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM2_OC3) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM5_OC3) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM5_OC4) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM8_OC5) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM15_OC2))

/*! Assert definitions for comparator output blanking (specific to COMP2). */
#define IS_COMP_OUTPUT_BLANK_COMP2(output_blank) (((output_blank) == HAL_COMP_OUTPUT_BLANK_NONE) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM1_OC5) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM2_OC3) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM5_OC3) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM5_OC4) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM8_OC5) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_TIM15_OC2) \
                                                  || ((output_blank) == HAL_COMP_OUTPUT_BLANK_LPTIM1_OC1))

/*! Assert definitions for comparator output blanking. */
#define IS_COMP_OUTPUT_BLANK(instance, output_blank) (((instance) == HAL_COMP1) ? \
                                                      IS_COMP_OUTPUT_BLANK_COMP1(output_blank) :\
                                                      IS_COMP_OUTPUT_BLANK_COMP2(output_blank))

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
/*! Assert definitions of comparator output trigger */
#define IS_COMP_OUTPUT_TRIG(output_trigger) (((output_trigger) == HAL_COMP_OUTPUT_TRIG_NONE) \
                                             || ((output_trigger) == HAL_COMP_OUTPUT_TRIG_RISING)  \
                                             || ((output_trigger) == HAL_COMP_OUTPUT_TRIG_FALLING) \
                                             || ((output_trigger) == HAL_COMP_OUTPUT_TRIG_RISING_FALLING))
#else
/*! Assert definitions of comparator output trigger */
#define IS_COMP_OUTPUT_TRIG(output_trigger) ((output_trigger) == HAL_COMP_OUTPUT_TRIG_NONE)
#endif /* USE_HAL_COMP_EXTI */

#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
/*! Assert definitions of comparators window output */
#define IS_COMP_WINDOW_OUTPUT(window_output) (((window_output) == HAL_COMP_WINDOW_OUTPUT_INDEPT) \
                                              || ((window_output) == HAL_COMP_WINDOW_OUTPUT_XOR))
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */

/*! Assert definitions of comparator event */
#define IS_COMP_EVENT(event) ((event) == HAL_COMP_EVENT_OUTPUT_TRIGGER)

/**
  * @}
  */

/**
  * @}
  */

/* Private functions ---------------------------------------------------------*/
/** @defgroup COMP_Private_Functions COMP Private Functions
  * @{
  */
static hal_status_t comp_activate(hal_comp_handle_t *hcomp);
#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
static hal_status_t comp_window_activate(hal_comp_handle_t *hcomp_a, hal_comp_handle_t *hcomp_b);
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */
/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup COMP_Exported_Functions
  * @{
  */

/** @addtogroup COMP_Exported_Functions_Group1
  * @{
    Set of functions to initialize and deinitialize the COMPx peripheral:
      + HAL_COMP_Init(): associate HAL COMP handle with selected COMP instance,
      + HAL_COMP_DeInit(): restore the default configuration of the HAL COMP handle,
      + HAL_COMP_WINDOW_SetHandle(): link HAL COMP handles sharing common features (window mode).
  */

/**
  * @brief  Initialize HAL COMP handle and associate it to the selected COMP instance.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @param  instance COMP instance.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         HAL COMP handle is already initialized and cannot be modified.
  * @retval HAL_OK            HAL COMP handle has been correctly initialized.
  */
hal_status_t HAL_COMP_Init(hal_comp_handle_t *hcomp, hal_comp_t instance)
{
  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM(IS_COMP_ALL_INSTANCE((COMP_TypeDef *)((uint32_t)instance)));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (hcomp == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcomp->instance = instance;

#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
  hcomp->p_link_next_handle = (hal_comp_handle_t *) NULL;
  hcomp->window_instance = HAL_COMP_WINDOW_INST_NONE;
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */

#if defined(USE_HAL_COMP_USER_DATA) && (USE_HAL_COMP_USER_DATA == 1)
  hcomp->p_user_data = (void *) NULL;
#endif /* USE_HAL_COMP_USER_DATA */

#if defined(USE_HAL_COMP_REGISTER_CALLBACKS) && (USE_HAL_COMP_REGISTER_CALLBACKS == 1U)
  /* Init the COMP Callback settings */
  hcomp->p_output_trigger_cb = HAL_COMP_OutputTriggerCallback;
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  hcomp->exti_line = COMP_GET_EXTI_LINE(instance);
  hcomp->output_trigger = HAL_COMP_OUTPUT_TRIG_NONE;
#endif /* USE_HAL_COMP_EXTI */

