MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
#if defined(USE_HAL_COMP_CLK_ENABLE_MODEL) && (USE_HAL_COMP_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  /* Enable peripheral clock */
#if defined(COMP1) && defined(COMP2)
  if ((instance == HAL_COMP1) || (instance == HAL_COMP2))
  {
    HAL_RCC_COMP12_EnableClock();
  }
#else
  HAL_RCC_COMP12_EnableClock();
#endif /* COMP1 && COMP2 */
#endif /* USE_HAL_COMP_CLK_ENABLE_MODEL */

  /* Initialize HAL COMP state machine */
  hcomp->global_state = HAL_COMP_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  Deinitialize the COMP peripheral.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  */
void HAL_COMP_DeInit(hal_comp_handle_t *hcomp)
{
  ASSERT_DBG_PARAM(hcomp != NULL);

  /* Stop the current operations */
  if (hcomp->global_state == HAL_COMP_STATE_ACTIVE)
  {
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp));
  }
#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
  else if (hcomp->global_state == HAL_COMP_STATE_WINDOW_ACTIVE)
  {
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp));
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp->p_link_next_handle));
    hcomp->p_link_next_handle->global_state = HAL_COMP_STATE_WINDOW_IDLE;
  }
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */
  else
  {
    /* No action */
  }

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  LL_EXTI_DisableEvent_32_63(hcomp->exti_line);
  LL_EXTI_DisableIT_32_63(hcomp->exti_line);
  LL_EXTI_DisableRisingTrig_32_63(hcomp->exti_line);
  LL_EXTI_DisableFallingTrig_32_63(hcomp->exti_line);
#endif /* USE_HAL_COMP_EXTI */

#if defined(USE_HAL_COMP_USER_DATA) && (USE_HAL_COMP_USER_DATA == 1)
  hcomp->p_user_data = NULL;
#endif /* USE_HAL_COMP_USER_DATA */

#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
  /* Check whether handle is registered in a handles daisy chain */
  if (hcomp->p_link_next_handle != NULL)
  {
    /* Remove handle from daisy chain (current and other handle) */
    if (hcomp->p_link_next_handle->p_link_next_handle == hcomp) /* Ensure other handle pointer validity */
    {
      hcomp->p_link_next_handle->p_link_next_handle = NULL;
    }
    hcomp->p_link_next_handle = NULL;
  }
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */

  hcomp->global_state = HAL_COMP_STATE_RESET;
}

#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
/**
  * @brief  Link HAL COMP handles sharing common features (window mode).
  * @param  hcomp_upper Pointer to hal_comp_handle_t structure of a COMP instance
  *                     (not yet linked or already linked to a chain).
  * @param  hcomp_lower Pointer to hal_comp_handle_t structure of another COMP instance sharing common features
  *                     (not yet linked: to be added to an existing chain).
  * @note   Link can be performed even if not using the common features.
  *         It is recommended to systematically link handles (when compliant instances): this allows functions
  *         to perform all cross instances checks possible, for optimal HAL COMP driver usage.
  * @note   Links are used to access multiple HAL COMP handles (daisy chain: from one to another and circular).
  *         Used by functions configuring parameters impacting multiple COMP instances.
  * @note   A handle can be removed from a chain using function @ref HAL_COMP_DeInit().
  * @warning Requirement: the selected device must have at least 2 COMP instances sharing the same COMP common instance.
  *          Refer to device reference manual of COMP LL driver macro "LL_COMP_COMMON_INSTANCE()" returning
  *          COMP common instance from COMP instance.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_SetHandle(hal_comp_handle_t *hcomp_upper, hal_comp_handle_t *hcomp_lower)
{
  hal_status_t status = HAL_OK;

  /* Check the COMP handles */
  ASSERT_DBG_PARAM((hcomp_upper != NULL));
  ASSERT_DBG_PARAM((hcomp_lower != NULL));

  /* Check whether selected COMP instances are different */
  ASSERT_DBG_PARAM(hcomp_upper->instance != hcomp_lower->instance);

  /* Ensure new handle is not already linked */
  ASSERT_DBG_PARAM(hcomp_lower->p_link_next_handle == NULL);

  /* Check whether selected COMP instances belong to the same COMP common instance */
  ASSERT_DBG_PARAM(LL_COMP_COMMON_INSTANCE(COMP_GET_INSTANCE(hcomp_upper))
                   == LL_COMP_COMMON_INSTANCE(COMP_GET_INSTANCE(hcomp_lower)));

  ASSERT_DBG_STATE(hcomp_upper->global_state,
                   (uint32_t)HAL_COMP_STATE_INIT |
                   (uint32_t)HAL_COMP_STATE_IDLE);
  ASSERT_DBG_STATE(hcomp_lower->global_state,
                   (uint32_t)HAL_COMP_STATE_INIT |
                   (uint32_t)HAL_COMP_STATE_IDLE);

  /* Set handles assignment in window */
  hcomp_upper->window_instance = HAL_COMP_WINDOW_INST_UPPER;
  hcomp_lower->window_instance = HAL_COMP_WINDOW_INST_LOWER;

  /* Link handles (daisy chain) */
  hcomp_lower->p_link_next_handle = hcomp_upper;
  hcomp_upper->p_link_next_handle = hcomp_lower;

  hcomp_upper->global_state = HAL_COMP_STATE_LINKED;
  hcomp_lower->global_state = HAL_COMP_STATE_LINKED;

  return status;
}
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */

/**
  * @}
  */

/** @addtogroup COMP_Exported_Functions_Group2
  * @{
    Set of functions to configure COMPx peripheral:
      + HAL_COMP_SetConfig(): Configure comparator.
      + HAL_COMP_GetConfig(): Get comparator configuration.
      + HAL_COMP_SetInputPlus(): Unitary configuration: Set comparator input plus configuration.
      + HAL_COMP_GetInputPlus(): Unitary configuration: Get comparator input plus configuration.
      + HAL_COMP_SetInputMinus(): Unitary configuration: Set comparator input minus configuration.
      + HAL_COMP_GetInputMinus(): Unitary configuration: Get comparator input minus configuration.
      + HAL_COMP_SetOutputBlanking(): Unitary configuration: Set comparator output blanking (optional).
      + HAL_COMP_GetOutputBlanking(): Unitary configuration: Get comparator output blanking (optional).
      + HAL_COMP_WINDOW_SetConfig(): Configure comparators in window mode.
      + HAL_COMP_WINDOW_GetConfig(): Get window comparators configuration.
      + HAL_COMP_WINDOW_SetInput(): Unitary configuration: Set window comparators input plus configuration
        (common to both comparator instances)
      + HAL_COMP_WINDOW_GetInput(): Unitary configuration: Get window comparators input plus configuration
        (common to both comparator instances)
      + HAL_COMP_WINDOW_SetUpperThreshold(): Unitary configuration: Set window comparators input minus configuration
        (for comparator instance assigned to upper threshold)
      + HAL_COMP_WINDOW_GetUpperThreshold(): Unitary configuration: Set window comparators input minus configuration
        (for comparator instance assigned to upper threshold)
      + HAL_COMP_WINDOW_SetLowerThreshold(): Unitary configuration: Set window comparators input minus configuration
        (for comparator instance assigned to lower threshold)
      + HAL_COMP_WINDOW_GetLowerThreshold(): Unitary configuration: Set window comparators input minus configuration
        (for comparator instance assigned to lower threshold)
      + HAL_COMP_WINDOW_SetOutputBlanking(): Unitary configuration: Set window comparators output blanking (optional).
      + HAL_COMP_WINDOW_GetOutputBlanking(): Unitary configuration: Get window comparators output blanking (optional).
  */

/**
  * @brief  Configure comparator.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  p_config Pointer to a @ref hal_comp_config_t structure containing COMP configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_SetConfig(hal_comp_handle_t *hcomp, const hal_comp_config_t *p_config)
{
  hal_status_t status = HAL_ERROR;
  COMP_TypeDef *p_instance;
  uint32_t reg_config;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_COMP_POWER_MODE(p_config->power_mode));
  ASSERT_DBG_PARAM(IS_COMP_INPUT_PLUS(hcomp->instance, p_config->input_plus));
  ASSERT_DBG_PARAM(IS_COMP_INPUT_MINUS(hcomp->instance, p_config->input_minus));
  ASSERT_DBG_PARAM(IS_COMP_INPUT_HYSTERESIS(p_config->input_hysteresis));
  ASSERT_DBG_PARAM(IS_COMP_OUTPUT_POLARITY(p_config->output_polarity));
#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  ASSERT_DBG_PARAM(IS_COMP_OUTPUT_TRIG(p_config->output_trigger));
#endif /* USE_HAL_COMP_EXTI */

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_INIT |
                   (uint32_t)HAL_COMP_STATE_IDLE |
                   (uint32_t)HAL_COMP_STATE_LINKED);

  p_instance = COMP_GET_INSTANCE(hcomp);

  if (LL_COMP_IsLocked(p_instance) == 0UL)
  {
    /* Set COMP configuration in a single register write access
       (equivalent to successive calls of configuration functions LL_COMP_Set...()) */
    reg_config = LL_COMP_READ_REG(p_instance, CFGR1);
    reg_config &= ~(COMP_CFGR1_PWRMODE
                    | COMP_CFGR1_INPSEL
                    | COMP_CFGR1_INMSEL
                    | COMP_CFGR1_SCALEN
                    | COMP_CFGR1_BRGEN
                    | COMP_CFGR1_HYST
                    | COMP_CFGR1_POLARITY);
    reg_config |= ((uint32_t)p_config->power_mode
                   | (uint32_t)p_config->input_plus
                   | (uint32_t)p_config->input_minus
                   | (uint32_t)p_config->input_hysteresis
                   | (uint32_t)p_config->output_polarity);
    LL_COMP_WRITE_REG(p_instance, CFGR1, reg_config);

    if (p_config->input_minus == HAL_COMP_INPUT_MINUS_TEMPSENSOR)
    {
      LL_COMP_EnableInputTempSensorBuffer(p_instance);
    }

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
    /* Set HAL COMP handle with output trigger state for further usage in operation functions */
    hcomp->output_trigger = p_config->output_trigger;

