MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
    /* Set comparator output trigger through EXTI */
    if (((uint32_t)p_config->output_trigger & (uint32_t)HAL_COMP_OUTPUT_TRIG_RISING) != 0U)
    {
      LL_EXTI_EnableRisingTrig_32_63(hcomp->exti_line);
    }
    else
    {
      LL_EXTI_DisableRisingTrig_32_63(hcomp->exti_line);
    }

    if (((uint32_t)p_config->output_trigger & (uint32_t)HAL_COMP_OUTPUT_TRIG_FALLING) != 0U)
    {
      LL_EXTI_EnableFallingTrig_32_63(hcomp->exti_line);
    }
    else
    {
      LL_EXTI_DisableFallingTrig_32_63(hcomp->exti_line);
    }
#endif /* USE_HAL_COMP_EXTI */

    status = HAL_OK;

    hcomp->global_state = HAL_COMP_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Get comparator configuration.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  p_config Pointer to a @ref hal_comp_config_t structure containing the COMP configuration.
  */
void HAL_COMP_GetConfig(const hal_comp_handle_t *hcomp, hal_comp_config_t *p_config)
{
  COMP_TypeDef *p_instance;
  uint32_t reg_config;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_LINKED |
                   (uint32_t)HAL_COMP_STATE_IDLE |
                   (uint32_t)HAL_COMP_STATE_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);

  /* For optimization purpose, get comparator configuration with one register access.
     (equivalent to calls of unitary LL functions LL_COMP_Getx()) */
  reg_config = LL_COMP_READ_REG(p_instance, CFGR1);
  p_config->power_mode = (hal_comp_power_mode_t)((uint32_t)(reg_config & COMP_CFGR1_PWRMODE));
  p_config->input_hysteresis = (hal_comp_input_hysteresis_t)((uint32_t)(reg_config & COMP_CFGR1_HYST));
  p_config->output_polarity = (hal_comp_output_polarity_t)((uint32_t)(reg_config & COMP_CFGR1_POLARITY));

  p_config->input_plus = (hal_comp_input_plus_t)LL_COMP_GetInputPlus(p_instance);
  p_config->input_minus = (hal_comp_input_minus_t)LL_COMP_GetInputMinus(p_instance);

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  p_config->output_trigger = hcomp->output_trigger;
#endif /* USE_HAL_COMP_EXTI */
}

/**
  * @brief  Set comparator input plus configuration.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  input_plus Value of @ref hal_comp_input_plus_t.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_SetInputPlus(hal_comp_handle_t *hcomp, hal_comp_input_plus_t input_plus)
{
  hal_status_t status = HAL_OK;
  COMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM(IS_COMP_INPUT_PLUS(hcomp->instance, input_plus));

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_IDLE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  LL_COMP_SetInputPlus(p_instance, (uint32_t)input_plus);

  return status;
}

/**
  * @brief  Get comparator input plus configuration.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @retval hal_comp_input_plus_t Comparator input plus value.
  */
hal_comp_input_plus_t HAL_COMP_GetInputPlus(const hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_input_plus_t input_plus;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_LINKED |
                   (uint32_t)HAL_COMP_STATE_IDLE |
                   (uint32_t)HAL_COMP_STATE_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  input_plus = (hal_comp_input_plus_t)LL_COMP_GetInputPlus(p_instance);

  return input_plus;
}

/**
  * @brief  Set comparator input minus configuration.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  input_minus Value of @ref hal_comp_input_minus_t.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_SetInputMinus(hal_comp_handle_t *hcomp, hal_comp_input_minus_t input_minus)
{
  hal_status_t status = HAL_OK;
  COMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM(IS_COMP_INPUT_MINUS(hcomp->instance, input_minus));

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_IDLE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  LL_COMP_SetInputMinus(p_instance, (uint32_t)input_minus);
  if (input_minus == HAL_COMP_INPUT_MINUS_TEMPSENSOR)
  {
    LL_COMP_EnableInputTempSensorBuffer(p_instance);
  }

  return status;
}

/**
  * @brief  Get comparator input minus configuration.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @retval hal_comp_input_minus_t Comparator input minus value.
  */
hal_comp_input_minus_t HAL_COMP_GetInputMinus(const hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_input_minus_t input_minus;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_LINKED |
                   (uint32_t)HAL_COMP_STATE_IDLE |
                   (uint32_t)HAL_COMP_STATE_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  input_minus = (hal_comp_input_minus_t)LL_COMP_GetInputMinus(p_instance);

  return input_minus;
}

/**
  * @brief  Set comparator output blanking.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  output_blank Value of @ref hal_comp_output_blank_t.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_SetOutputBlanking(hal_comp_handle_t *hcomp, hal_comp_output_blank_t output_blank)
{
  hal_status_t status = HAL_OK;
  COMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM(IS_COMP_OUTPUT_BLANK(hcomp->instance, output_blank));

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_IDLE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  LL_COMP_SetOutputBlankingSource(p_instance, (uint32_t)output_blank);

  return status;
}

/**
  * @brief  Get comparator output blanking.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @retval hal_comp_output_blank_t Comparator output blanking value.
  */
hal_comp_output_blank_t HAL_COMP_GetOutputBlanking(hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_output_blank_t output_blank;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_LINKED |
                   (uint32_t)HAL_COMP_STATE_IDLE |
                   (uint32_t)HAL_COMP_STATE_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  output_blank = (hal_comp_output_blank_t) LL_COMP_GetOutputBlankingSource(p_instance);

  return output_blank;
}

#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
/**
  * @brief  Configure comparators in window mode.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  p_config Pointer to a @ref hal_comp_window_config_t structure containing COMP configuration.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_SetConfig(hal_comp_handle_t *hcomp, const hal_comp_window_config_t *p_config)
{
  hal_status_t status = HAL_OK;
  COMP_TypeDef *p_instance_upper;
  COMP_TypeDef *p_instance_lower;
  COMP_Common_TypeDef *p_instance_common;
  uint32_t reg_config;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  ASSERT_DBG_PARAM(IS_COMP_POWER_MODE(p_config->power_mode));
  ASSERT_DBG_PARAM(IS_COMP_INPUT_PLUS(hcomp->instance, p_config->input));
  ASSERT_DBG_PARAM(IS_COMP_INPUT_MINUS(hcomp->instance, p_config->upper_threshold));
  ASSERT_DBG_PARAM(IS_COMP_INPUT_MINUS(hcomp->instance, p_config->lower_threshold));
  ASSERT_DBG_PARAM(IS_COMP_INPUT_HYSTERESIS(p_config->input_hysteresis));
  ASSERT_DBG_PARAM(IS_COMP_OUTPUT_POLARITY(p_config->output_polarity));
#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  ASSERT_DBG_PARAM(IS_COMP_OUTPUT_TRIG(p_config->output_trigger));
#endif /* USE_HAL_COMP_EXTI */
  ASSERT_DBG_PARAM(IS_COMP_WINDOW_OUTPUT(p_config->window_output_mode));

