MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
  /* Note: State verified on only one handle (among two handles of window mode) due to replication of state
           on all handles linked */
  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_LINKED |
                   (uint32_t)HAL_COMP_STATE_WINDOW_IDLE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_UPPER)
  {
    p_instance_upper = COMP_GET_INSTANCE(hcomp);
    p_instance_lower = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  else
  {
    p_instance_lower = COMP_GET_INSTANCE(hcomp);
    p_instance_upper = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  p_instance_common = LL_COMP_COMMON_INSTANCE(p_instance_upper);

  uint32_t lock_status = LL_COMP_IsLocked(p_instance_upper);
  lock_status |= LL_COMP_IsLocked(p_instance_lower);
  if (lock_status != 0UL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Set COMP configuration in a single register write access
       (equivalent to successive calls of configuration functions LL_COMP_Set...()) */
    reg_config = LL_COMP_READ_REG(p_instance_upper, CFGR1);
    reg_config &= ~(COMP_CFGR1_PWRMODE
                    | COMP_CFGR1_INPSEL
                    | COMP_CFGR1_INMSEL
                    | COMP_CFGR1_SCALEN
                    | COMP_CFGR1_BRGEN
                    | COMP_CFGR1_HYST
                    | COMP_CFGR1_POLARITY);
    reg_config |= ((uint32_t)p_config->power_mode
                   | (uint32_t)p_config->input
                   | (uint32_t)p_config->upper_threshold
                   | (uint32_t)p_config->input_hysteresis
                   | (uint32_t)p_config->output_polarity);
    LL_COMP_WRITE_REG(p_instance_upper, CFGR1, reg_config);

    reg_config &= ~(COMP_CFGR1_INPSEL
                    | COMP_CFGR1_INMSEL);
    reg_config |= (uint32_t)p_config->lower_threshold;
    LL_COMP_WRITE_REG(p_instance_lower, CFGR1, reg_config);

    /* Configuration specific to comparators instances upper and lower */
    LL_COMP_SetCommonWindowMode(p_instance_common, LL_COMP_WINDOW_INST_TO_INPUT_PLUS(p_instance_upper));

    if (p_config->window_output_mode == HAL_COMP_WINDOW_OUTPUT_INDEPT)
    {
      LL_COMP_SetCommonWindowOutput(p_instance_common, LL_COMP_WINDOW_OUTPUT_INDEPT);
    }
    else
    {
      LL_COMP_SetCommonWindowOutput(p_instance_common, LL_COMP_WINDOW_INST_TO_OUTPUT(p_instance_upper));
    }

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
    /* Set HAL COMP handle with output trigger state for further usage in operation functions */
    hcomp->output_trigger = p_config->output_trigger;
    hcomp->p_link_next_handle->output_trigger = p_config->output_trigger;

    /* Set comparator output trigger through EXTI */
    if (((uint32_t)p_config->output_trigger & (uint32_t)HAL_COMP_OUTPUT_TRIG_RISING) != 0U)
    {
      LL_EXTI_EnableRisingTrig_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
    }
    else
    {
      LL_EXTI_DisableRisingTrig_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
    }

    if (((uint32_t)p_config->output_trigger & (uint32_t)HAL_COMP_OUTPUT_TRIG_FALLING) != 0U)
    {
      LL_EXTI_EnableFallingTrig_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
    }
    else
    {
      LL_EXTI_DisableFallingTrig_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
    }
#endif /* USE_HAL_COMP_EXTI */

    hcomp->global_state = HAL_COMP_STATE_WINDOW_IDLE;
    hcomp->p_link_next_handle->global_state = HAL_COMP_STATE_WINDOW_IDLE;
  }

  return status;
}

/**
  * @brief  Get window comparators configuration.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @param  p_config Pointer to a hal_comp_window_config_t structure containing COMP configuration.
  */
void HAL_COMP_WINDOW_GetConfig(const hal_comp_handle_t *hcomp, hal_comp_window_config_t *p_config)
{
  COMP_TypeDef *p_instance_upper;
  COMP_TypeDef *p_instance_lower;
  COMP_Common_TypeDef *p_instance_common;
  uint32_t reg_config;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM((p_config != NULL));

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_IDLE |
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_UPPER)
  {
    p_instance_upper = COMP_GET_INSTANCE(hcomp);
    p_instance_lower = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  else
  {
    p_instance_lower = COMP_GET_INSTANCE(hcomp);
    p_instance_upper = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  p_instance_common = LL_COMP_COMMON_INSTANCE(p_instance_upper);

  /* Configuration common to both comparators */
  /* For optimization purpose, get comparator configuration with one register access.
     (equivalent to calls of unitary LL functions LL_COMP_Getx()) */
  reg_config = LL_COMP_READ_REG(p_instance_upper, CFGR1);
  p_config->power_mode = (hal_comp_power_mode_t)((uint32_t)(reg_config & COMP_CFGR1_PWRMODE));
  p_config->input_hysteresis = (hal_comp_input_hysteresis_t)((uint32_t)(reg_config & COMP_CFGR1_HYST));
  p_config->output_polarity = (hal_comp_output_polarity_t)((uint32_t)(reg_config & COMP_CFGR1_POLARITY));

  p_config->input = (hal_comp_input_plus_t)LL_COMP_GetInputPlus(p_instance_upper);

  /* Configuration specific to each comparator */
  p_config->upper_threshold = (hal_comp_input_minus_t)LL_COMP_GetInputMinus(p_instance_upper);
  p_config->lower_threshold = (hal_comp_input_minus_t)LL_COMP_GetInputMinus(p_instance_lower);


  if (LL_COMP_GetCommonWindowOutput(p_instance_common) != LL_COMP_WINDOW_OUTPUT_INDEPT)
  {
    p_config->window_output_mode = HAL_COMP_WINDOW_OUTPUT_XOR;
  }

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  p_config->output_trigger = hcomp->output_trigger;
#endif /* USE_HAL_COMP_EXTI */
}

/**
  * @brief  Set window comparators input plus configuration (common to both comparator instances).
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  input Value of @ref hal_comp_input_plus_t.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_SetInput(hal_comp_handle_t *hcomp, hal_comp_input_plus_t input)
{
  hal_status_t status = HAL_OK;
  COMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM(IS_COMP_INPUT_PLUS(hcomp->instance, input));

