MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_WINDOW_IDLE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_UPPER)
  {
    p_instance = COMP_GET_INSTANCE(hcomp);
  }
  else
  {
    p_instance = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  LL_COMP_SetInputPlus(p_instance, (uint32_t)input);

  return status;
}

/**
  * @brief  Get window comparators input plus configuration (common to both comparator instances).
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @retval hal_comp_input_plus_t Window comparators input plus value.
  */
hal_comp_input_plus_t HAL_COMP_WINDOW_GetInput(const hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_input_plus_t input_plus;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_IDLE |
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_UPPER)
  {
    p_instance = COMP_GET_INSTANCE(hcomp);
  }
  else
  {
    p_instance = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  input_plus = (hal_comp_input_plus_t)LL_COMP_GetInputPlus(p_instance);

  return input_plus;
}

/**
  * @brief  Set window comparators input minus configuration (for comparator instance assigned to upper threshold).
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  upper_threshold Value of @ref hal_comp_input_minus_t.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_SetUpperThreshold(hal_comp_handle_t *hcomp, hal_comp_input_minus_t upper_threshold)
{
  hal_status_t status = HAL_OK;
  COMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM(IS_COMP_INPUT_MINUS(hcomp->instance, upper_threshold));

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_WINDOW_IDLE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_UPPER)
  {
    p_instance = COMP_GET_INSTANCE(hcomp);
  }
  else
  {
    p_instance = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  LL_COMP_SetInputMinus(p_instance, (uint32_t)upper_threshold);

  return status;
}

/**
  * @brief  Get window comparators input minus configuration (for comparator instance assigned to upper threshold).
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @retval hal_comp_input_minus_t Window comparators input minus value.
  */
hal_comp_input_minus_t HAL_COMP_WINDOW_GetUpperThreshold(const hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_input_minus_t upper_threshold;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_IDLE |
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_UPPER)
  {
    p_instance = COMP_GET_INSTANCE(hcomp);
  }
  else
  {
    p_instance = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  upper_threshold = (hal_comp_input_minus_t)LL_COMP_GetInputMinus(p_instance);

  return upper_threshold;
}

/**
  * @brief  Set window comparators input minus configuration (for comparator instance assigned to lower threshold).
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  lower_threshold Value of @ref hal_comp_input_minus_t.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_SetLowerThreshold(hal_comp_handle_t *hcomp, hal_comp_input_minus_t lower_threshold)
{
  hal_status_t status = HAL_OK;
  COMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM(IS_COMP_INPUT_MINUS(hcomp->instance, lower_threshold));

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_WINDOW_IDLE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_LOWER)
  {
    p_instance = COMP_GET_INSTANCE(hcomp);
  }
  else
  {
    p_instance = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  LL_COMP_SetInputMinus(p_instance, (uint32_t)lower_threshold);

  return status;
}

/**
  * @brief  Get window comparators input minus configuration (for comparator instance assigned to lower threshold).
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @retval hal_comp_input_minus_t Window comparators input minus value.
  */
hal_comp_input_minus_t HAL_COMP_WINDOW_GetLowerThreshold(const hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_input_minus_t lower_threshold;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_IDLE |
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_LOWER)
  {
    p_instance = COMP_GET_INSTANCE(hcomp);
  }
  else
  {
    p_instance = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  lower_threshold = (hal_comp_input_minus_t)LL_COMP_GetInputMinus(p_instance);

  return lower_threshold;
}

/**
  * @brief  Set window comparators output blanking.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @param  output_blank Value of @ref hal_comp_output_blank_t.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_SetOutputBlanking(hal_comp_handle_t *hcomp, hal_comp_output_blank_t output_blank)
{
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM(hcomp != NULL);
  ASSERT_DBG_PARAM(IS_COMP_OUTPUT_BLANK(hcomp->instance, output_blank));

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_WINDOW_IDLE);

  LL_COMP_SetOutputBlankingSource(COMP_GET_INSTANCE(hcomp), (uint32_t)output_blank);
  LL_COMP_SetOutputBlankingSource(COMP_GET_INSTANCE(hcomp->p_link_next_handle), (uint32_t)output_blank);

  return status;
}

/**
  * @brief  Get window comparators output blanking.
  * @param  hcomp Pointer to a @ref hal_comp_handle_t structure.
  * @retval hal_comp_output_blank_t Window comparators output blanking value.
  */
hal_comp_output_blank_t HAL_COMP_WINDOW_GetOutputBlanking(const hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_output_blank_t output_blank;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_IDLE |
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  output_blank = (hal_comp_output_blank_t) LL_COMP_GetOutputBlankingSource(p_instance);

  return output_blank;
}
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */

/**
  * @}
  */

/** @addtogroup COMP_Exported_Functions_Group3
  * @{
    Set of function to handle the COMP interrupts :
      + HAL_COMP_IRQHandler(): Handle all COMP interrupt requests.
  */

/**
  * @brief  Handle the COMP interrupt request.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  */
void HAL_COMP_IRQHandler(hal_comp_handle_t *hcomp)
{
#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  /* Check COMP EXTI flag */
  if (LL_EXTI_IsActiveRisingFlag_32_63(hcomp->exti_line) != 0UL)
  {
#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
    /* Check whether comparator is in independent or window mode */
    if (hcomp->global_state == HAL_COMP_STATE_WINDOW_ACTIVE)
    {
      /* Clear COMP EXTI line pending bit of the pair of comparators in window mode. */
      /* Note: Pair of comparators in window mode can both trig IRQ when input voltage is changing from "out of window"
               area (low or high ) to the other "out of window" area (high or low).
               Both flags must be cleared to call comparator trigger callback is called once. */
      LL_EXTI_ClearRisingFlag_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
#if defined(COMP_SR_C1IF)
      LL_COMP_ClearFlag_OutputTrig(COMP_GET_INSTANCE(hcomp->p_link_next_handle));
#endif /* COMP_SR_C1IF */
    }
    else
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */
    {
      /* Clear COMP EXTI line pending bit */
      LL_EXTI_ClearRisingFlag_32_63(hcomp->exti_line);
    }
#if defined(COMP_SR_C1IF)
    LL_COMP_ClearFlag_OutputTrig(COMP_GET_INSTANCE(hcomp));
#endif /* COMP_SR_C1IF */

#if defined(USE_HAL_COMP_REGISTER_CALLBACKS) && (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
    hcomp->p_output_trigger_cb(hcomp);
#else
    HAL_COMP_OutputTriggerCallback(hcomp);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
  }
  if (LL_EXTI_IsActiveFallingFlag_32_63(hcomp->exti_line) != 0UL)
  {
#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
    /* Check whether comparator is in independent or window mode */
    if (hcomp->global_state == HAL_COMP_STATE_WINDOW_ACTIVE)
    {
      /* Clear COMP EXTI line pending bit of the pair of comparators in window mode. */
      /* Note: Pair of comparators in window mode can both trig IRQ when input voltage is changing from "out of window"
               area (low or high ) to the other "out of window" area (high or low).
               Both flags must be cleared to call comparator trigger callback is called once. */
      LL_EXTI_ClearFallingFlag_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
#if defined(COMP_SR_C1IF)
      LL_COMP_ClearFlag_OutputTrig(COMP_GET_INSTANCE(hcomp->p_link_next_handle));
#endif /* COMP_SR_C1IF */
    }
    else
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */
    {
      /* Clear COMP EXTI line pending bit */
      LL_EXTI_ClearFallingFlag_32_63(hcomp->exti_line);
    }
#if defined(COMP_SR_C1IF)
    LL_COMP_ClearFlag_OutputTrig(COMP_GET_INSTANCE(hcomp));
#endif /* COMP_SR_C1IF */

#if defined(USE_HAL_COMP_REGISTER_CALLBACKS) && (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
    hcomp->p_output_trigger_cb(hcomp);
#else
    HAL_COMP_OutputTriggerCallback(hcomp);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
  }
#else
  STM32_UNUSED(hcomp);
#endif /* USE_HAL_COMP_EXTI */
}

/**
  * @brief  Event callback.
  * @param  hcomp Pointer to a hal_comp_handle_t structure
  */
__WEAK void HAL_COMP_OutputTriggerCallback(hal_comp_handle_t *hcomp)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hcomp);

  /* Note : This function must not be modified. When the callback is needed, function
            HAL_COMP_EventICallback() can be implemented in the user file. */
}

#if defined(USE_HAL_COMP_REGISTER_CALLBACKS) && (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register the COMP output trigger callback to be used instead of
            the weak HAL_COMP_OutputTriggerCallback() predefined callback.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @param  p_callback Pointer to the hal_comp_cb_t Comparator trigger callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_RegisterOutputTriggerCallback(hal_comp_handle_t *hcomp, hal_comp_cb_t p_callback)
{
  ASSERT_DBG_PARAM((hcomp != NULL));
  ASSERT_DBG_PARAM((p_callback != NULL));

#if defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

  hcomp->p_output_trigger_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */

/**
  * @}
  */

