MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
/** @addtogroup COMP_Exported_Functions_Group4
  * @{
    Set of function to handle the HAL COMP driver state and errors:
      + HAL_COMP_GetState(): Retrieve the HAL COMP global state,
  */

/**
  * @brief  Retrieve the HAL COMP global state.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @retval hal_comp_state_t HAL COMP global state.
  */
hal_comp_state_t HAL_COMP_GetState(const hal_comp_handle_t *hcomp)
{
  ASSERT_DBG_PARAM((hcomp != NULL));

  return hcomp->global_state;
}

/**
  * @}
  */

/** @addtogroup COMP_Exported_Functions_Group5
  * @{
    Set of functions to operate COMPx peripheral.
      + HAL_COMP_Start(): Start comparator.
      + HAL_COMP_Stop(): Stop comparator.
      + HAL_COMP_Start_IT(): Start comparator with interrupt.
      + HAL_COMP_Stop_IT(): Stop comparator with interrupt.
      + HAL_COMP_Lock(): Lock comparator.
      + HAL_COMP_IsLocked(): Check whether comparator is locked.
      + HAL_COMP_GetOutputLevel(): Get comparator output logical level.
      + HAL_COMP_WINDOW_Start(): Start window comparators.
      + HAL_COMP_WINDOW_Stop(): Stop window comparators.
      + HAL_COMP_WINDOW_Start_IT(): Start window comparators with interrupt.
      + HAL_COMP_WINDOW_Stop_IT(): Stop window comparators with interrupt.
      + HAL_COMP_WINDOW_Lock(): Lock window comparators.
      + HAL_COMP_WINDOW_IsLocked(): Check whether window comparators is locked.
      + HAL_COMP_WINDOW_GetOutputLevel(): Get window comparators output logical level.
  */

/**
  * @brief  Start comparator.
  * @param  hcomp Pointer to a hal_comp_handle_t structure
  * @note   Depending on configuration of output trigger to system (hal_comp_output_trigger_t),
  *         comparator can generate events to system.
  *         Output trigger edge selection is optional (selected parameter can be no trigger).
  * @retval HAL_BUSY          HAL COMP state machine not in expected initial state
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_Start(hal_comp_handle_t *hcomp)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hcomp, global_state, HAL_COMP_STATE_IDLE, HAL_COMP_STATE_ACTIVE);

  /* Activate comparator */
  status = comp_activate(hcomp);

  if (status != HAL_OK)
  {
    hcomp->global_state = HAL_COMP_STATE_IDLE;
  }
#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  else
  {
    if (hcomp->output_trigger != HAL_COMP_OUTPUT_TRIG_NONE)
    {
      LL_EXTI_ClearRisingFlag_32_63(hcomp->exti_line);
      LL_EXTI_ClearFallingFlag_32_63(hcomp->exti_line);
      LL_EXTI_EnableEvent_32_63(hcomp->exti_line);
    }
  }
#endif /* USE_HAL_COMP_EXTI */

  return status;
}

/**
  * @brief  Stop comparator.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_Stop(hal_comp_handle_t *hcomp)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_ACTIVE);

  /* Deactivate comparator */
  if (LL_COMP_IsLocked(COMP_GET_INSTANCE(hcomp)) == 0UL)
  {
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp));

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
    if (hcomp->output_trigger != HAL_COMP_OUTPUT_TRIG_NONE)
    {
      LL_EXTI_DisableEvent_32_63(hcomp->exti_line);
    }
#endif /* USE_HAL_COMP_EXTI */

    status = HAL_OK;

    hcomp->global_state = HAL_COMP_STATE_IDLE;
  }

  return status;
}

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
/**
  * @brief  Start comparator with interrupt: default interrupts.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @note   Depending on configuration of output trigger to system @ref hal_comp_output_trigger_t,
  *         comparator can generate events and interrupt to system.
  *         Output trigger edge selection is mandatory (selected parameter must be different of no trigger).
  * @retval HAL_BUSY          HAL COMP state machine not in expected initial state
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_Start_IT(hal_comp_handle_t *hcomp)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hcomp != NULL);
#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(hcomp->output_trigger != HAL_COMP_OUTPUT_TRIG_NONE);
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_IDLE);

  HAL_CHECK_UPDATE_STATE(hcomp, global_state, HAL_COMP_STATE_IDLE, HAL_COMP_STATE_ACTIVE);

  /* Activate comparator */
  status = comp_activate(hcomp);

  if (status == HAL_OK)
  {
    LL_EXTI_ClearRisingFlag_32_63(hcomp->exti_line);
    LL_EXTI_ClearFallingFlag_32_63(hcomp->exti_line);
    LL_EXTI_EnableIT_32_63(hcomp->exti_line);
  }
  else
  {
    hcomp->global_state = HAL_COMP_STATE_IDLE;
  }

  return status;
}

/**
  * @brief  Stop comparator in interrupt mode.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_Stop_IT(hal_comp_handle_t *hcomp)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_ACTIVE);

  /* Deactivate comparator */
  if (LL_COMP_IsLocked(COMP_GET_INSTANCE(hcomp)) == 0UL)
  {
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp));

    LL_EXTI_DisableIT_32_63(hcomp->exti_line);

    status = HAL_OK;

    hcomp->global_state = HAL_COMP_STATE_IDLE;
  }

  return status;
}
#endif /* USE_HAL_COMP_EXTI */

/**
  * @brief  Lock comparator.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @note   Once locked, comparator configuration cannot be changed (use case: safety purpose).
  * @note   Comparator can be unlocked with a system reset.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_Lock(hal_comp_handle_t *hcomp)
{
  hal_status_t status = HAL_OK;
  COMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_IDLE |
                   (uint32_t)HAL_COMP_STATE_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  LL_COMP_Lock(p_instance);

