MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
  return status;
}

/**
  * @brief  Check whether comparator is locked.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @retval Value of hal_comp_lock_status_t.
  */
hal_comp_lock_status_t HAL_COMP_IsLocked(hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_lock_status_t lock_state;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_IDLE |
                   (uint32_t)HAL_COMP_STATE_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  lock_state = (hal_comp_lock_status_t)LL_COMP_IsLocked(p_instance);

  return lock_state;
}

/**
  * @brief  Get comparator output logical level.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @retval Value of hal_comp_output_level_t.
  */
hal_comp_output_level_t HAL_COMP_GetOutputLevel(hal_comp_handle_t *hcomp)
{
  hal_comp_output_level_t output_level;
  COMP_TypeDef *p_instance;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  output_level = (hal_comp_output_level_t)LL_COMP_ReadOutputLevel(p_instance);

  return output_level;
}

#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
/**
  * @brief  Start window comparators.
  * @brief  Depending on configuration of output trigger to system @ref hal_comp_output_trigger_t,
  *         comparator can generate events to system.
  * @param  hcomp Pointer to a HAL_COMP_WINDOW_handle_t structure.
  * @retval HAL_BUSY          HAL COMP state machine not in expected initial state
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_Start(hal_comp_handle_t *hcomp)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_WINDOW_IDLE);

  HAL_CHECK_UPDATE_STATE(hcomp, global_state, HAL_COMP_STATE_WINDOW_IDLE, HAL_COMP_STATE_WINDOW_ACTIVE);
  HAL_CHECK_UPDATE_STATE(hcomp->p_link_next_handle, global_state,
                         HAL_COMP_STATE_WINDOW_IDLE, HAL_COMP_STATE_WINDOW_ACTIVE);

  /* Activate comparators */
  status = comp_window_activate(hcomp, hcomp->p_link_next_handle);

  if (status != HAL_OK)
  {
    hcomp->global_state = HAL_COMP_STATE_IDLE;
    hcomp->p_link_next_handle->global_state = HAL_COMP_STATE_IDLE;
  }
#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
  else
  {
    if (hcomp->output_trigger != HAL_COMP_OUTPUT_TRIG_NONE)
    {
      LL_EXTI_ClearRisingFlag_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
      LL_EXTI_ClearFallingFlag_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
      LL_EXTI_EnableEvent_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
    }
  }
#endif /* USE_HAL_COMP_EXTI */

  return status;
}

/**
  * @brief  Stop window comparators.
  * @param  hcomp Pointer to a HAL_COMP_WINDOW_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_Stop(hal_comp_handle_t *hcomp)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  /* Deactivate comparators */
  if (LL_COMP_IsLocked(COMP_GET_INSTANCE(hcomp)) == 0UL)
  {
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp));
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp->p_link_next_handle));

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
    if (hcomp->output_trigger != HAL_COMP_OUTPUT_TRIG_NONE)
    {
      LL_EXTI_DisableEvent_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
    }
#endif /* USE_HAL_COMP_EXTI */

    status = HAL_OK;

    hcomp->global_state = HAL_COMP_STATE_WINDOW_IDLE;
    hcomp->p_link_next_handle->global_state = HAL_COMP_STATE_WINDOW_IDLE;
  }

  return status;
}

#if defined(USE_HAL_COMP_EXTI) && (USE_HAL_COMP_EXTI == 1)
/**
  * @brief  Start window comparators with interrupt: default interrupts.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @note   Configuration prerequisite: select comparator output trigger (@ref hal_comp_output_trigger_t)
  *         with setting different of no trigger.
  * @retval HAL_BUSY          HAL COMP state machine not in expected initial state
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_Start_IT(hal_comp_handle_t *hcomp)
{
  hal_status_t status;

  ASSERT_DBG_PARAM(hcomp != NULL);
#if defined(USE_ASSERT_DBG_PARAM)
  ASSERT_DBG_PARAM(hcomp->output_trigger != HAL_COMP_OUTPUT_TRIG_NONE);
#endif /* USE_ASSERT_DBG_PARAM */

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_WINDOW_IDLE);

  HAL_CHECK_UPDATE_STATE(hcomp, global_state, HAL_COMP_STATE_WINDOW_IDLE, HAL_COMP_STATE_WINDOW_ACTIVE);
  HAL_CHECK_UPDATE_STATE(hcomp->p_link_next_handle, global_state,
                         HAL_COMP_STATE_WINDOW_IDLE,
                         HAL_COMP_STATE_WINDOW_ACTIVE);

  /* Activate comparators */
  status = comp_window_activate(hcomp, hcomp->p_link_next_handle);

  if (status == HAL_OK)
  {
    LL_EXTI_ClearRisingFlag_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
    LL_EXTI_ClearFallingFlag_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
    LL_EXTI_EnableIT_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);
  }
  else
  {
    hcomp->global_state = HAL_COMP_STATE_WINDOW_IDLE;
    hcomp->p_link_next_handle->global_state =  HAL_COMP_STATE_WINDOW_IDLE;
  }

  return status;
}

/**
  * @brief  Stop window comparators in interrupt mode.
  * @param  hcomp Pointer to a HAL_COMP_WINDOW_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_Stop_IT(hal_comp_handle_t *hcomp)
{
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  /* Deactivate comparators */
  if (LL_COMP_IsLocked(COMP_GET_INSTANCE(hcomp)) == 0UL)
  {
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp));
    LL_COMP_Disable(COMP_GET_INSTANCE(hcomp->p_link_next_handle));

