MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_comp.c
    LL_EXTI_DisableIT_32_63(hcomp->exti_line | hcomp->p_link_next_handle->exti_line);

    status = HAL_OK;

    hcomp->global_state = HAL_COMP_STATE_WINDOW_IDLE;
    hcomp->p_link_next_handle->global_state = HAL_COMP_STATE_WINDOW_IDLE;
  }

  return status;
}
#endif /* USE_HAL_COMP_EXTI */

/**
  * @brief  Lock window comparators.
  * @param  hcomp Pointer to a HAL_COMP_WINDOW_handle_t structure.
  * @note   Once locked, comparator configuration cannot be changed (use case: safety purpose).
  * @note   Comparator can be unlocked with a system reset.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
hal_status_t HAL_COMP_WINDOW_Lock(hal_comp_handle_t *hcomp)
{
  hal_status_t status = HAL_OK;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_IDLE |
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  LL_COMP_Lock(COMP_GET_INSTANCE(hcomp));
  LL_COMP_Lock(COMP_GET_INSTANCE(hcomp->p_link_next_handle));

  return status;
}

/**
  * @brief  Check whether window comparators are locked.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @retval Value of hal_comp_lock_status_t.
  */
hal_comp_lock_status_t HAL_COMP_WINDOW_IsLocked(hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance;
  hal_comp_lock_status_t lock_state;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state,
                   (uint32_t)HAL_COMP_STATE_WINDOW_IDLE |
                   (uint32_t)HAL_COMP_STATE_WINDOW_ACTIVE);

  p_instance = COMP_GET_INSTANCE(hcomp);
  lock_state = (hal_comp_lock_status_t)LL_COMP_IsLocked(p_instance);

  return lock_state;
}

/**
  * @brief  Get window comparators output logical level.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @retval Value of hal_comp_window_output_level_t.
  */
hal_comp_window_output_level_t HAL_COMP_WINDOW_GetOutputLevel(hal_comp_handle_t *hcomp)
{
  COMP_TypeDef *p_instance_upper;
  COMP_TypeDef *p_instance_lower;
  uint32_t instance_upper_output_level;
  uint32_t instance_lower_output_level;
  hal_comp_window_output_level_t window_output_level;

  ASSERT_DBG_PARAM(hcomp != NULL);

  ASSERT_DBG_STATE(hcomp->global_state, HAL_COMP_STATE_WINDOW_ACTIVE);

  if (hcomp->window_instance == HAL_COMP_WINDOW_INST_UPPER)
  {
    p_instance_upper = COMP_GET_INSTANCE(hcomp);
    p_instance_lower = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }
  else
  {
    p_instance_lower = COMP_GET_INSTANCE(hcomp);
    p_instance_upper = COMP_GET_INSTANCE(hcomp->p_link_next_handle);
  }

  /* Get each comparator output level */
  instance_upper_output_level = LL_COMP_ReadOutputLevel(p_instance_upper);
  instance_lower_output_level = LL_COMP_ReadOutputLevel(p_instance_lower);

  /* Determine status within or out of window (logical "exclusive or" operation) */
  if ((instance_upper_output_level ^ instance_lower_output_level) != 0UL)
  {
    window_output_level = HAL_COMP_WINDOW_OUTPUT_LEVEL_WITHIN;
  }
  else
  {
    /* Determine status above or below window */
    if (instance_upper_output_level == LL_COMP_OUTPUT_LEVEL_HIGH)
    {
      window_output_level = HAL_COMP_WINDOW_OUTPUT_LEVEL_ABOVE;
    }
    else
    {
      window_output_level = HAL_COMP_WINDOW_OUTPUT_LEVEL_BELOW;
    }
  }

  return window_output_level;
}

#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */

/**
  * @}
  */

/** @addtogroup COMP_Exported_Functions_Group6  User data functions
  * @{
    This subsection provides functions to:
      + HAL_COMP_SetUserData(): Set a user data pointer (ex: a user context) in a HAL COMP handle,
      + HAL_COMP_GetUserData(): Get a user data pointer (ex: a user context) from a HAL COMP handle.
    @note A typical usage is to set user data pointer before starting a process,
          then retrieve it within the user process completion callback.
  */
#if defined(USE_HAL_COMP_USER_DATA) && (USE_HAL_COMP_USER_DATA == 1)
/**
  * @brief  Store  user data pointer into the comp handle.
  * @param  hcomp Pointer to a hal_comp_handle_t.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_COMP_SetUserData(hal_comp_handle_t *hcomp, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hcomp != NULL);

  hcomp->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve user data pointer from the comp handle.
  * @param  hcomp Pointer to a hal_comp_handle_t.
  * @retval (void*) the pointer to the user data, when previously set by HAL_COMP_SetUserData().
  * @retval NULL other way.
  */
const void *HAL_COMP_GetUserData(const hal_comp_handle_t *hcomp)
{
  ASSERT_DBG_PARAM(hcomp != NULL);

  return (hcomp->p_user_data);
}
#endif /* USE_HAL_COMP_USER_DATA */

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup COMP_Private_Functions
  * @{
  */

/**
  * @brief  Activate the selected comparator instance.
  * @param  hcomp Pointer to a hal_comp_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
static hal_status_t comp_activate(hal_comp_handle_t *hcomp)
{
  hal_status_t status = HAL_ERROR;
  COMP_TypeDef *p_instance;
  uint32_t delay_startup_us;

  p_instance = COMP_GET_INSTANCE(hcomp);

  if (LL_COMP_IsLocked(p_instance) == 0UL)
  {
    LL_COMP_Enable(p_instance);

    if (LL_COMP_IsInputScalerEnabled(p_instance) != 0UL)
    {
      /* Note: Stabilization delay of voltage scaler encompasses startup delay LL_COMP_DELAY_STARTUP_US */
      delay_startup_us = LL_COMP_DELAY_VOLTAGE_SCALER_STAB_US;
    }
    else
    {
      delay_startup_us = LL_COMP_DELAY_STARTUP_US;
    }

    /* Delay for COMP startup time. */
    COMP_DELAY_US(delay_startup_us);

    status = HAL_OK;
  }

  return status;
}

#if defined(COMP_WINDOW_MODE_SUPPORT)
#if defined(USE_HAL_COMP_WINDOW_MODE) && (USE_HAL_COMP_WINDOW_MODE == 1)
/**
  * @brief  Activate the selected window comparators instances.
  * @param  hcomp_a Pointer to a hal_comp_handle_t structure.
  * @param  hcomp_b Pointer to a hal_comp_handle_t structure.
  * @retval HAL_ERROR         Operation completed with error.
  * @retval HAL_OK            Operation completed successfully.
  */
static hal_status_t comp_window_activate(hal_comp_handle_t *hcomp_a, hal_comp_handle_t *hcomp_b)
{
  hal_status_t status = HAL_ERROR;
  COMP_TypeDef *p_instance_a;
  COMP_TypeDef *p_instance_b;
  uint32_t delay_startup_us;

  p_instance_a = COMP_GET_INSTANCE(hcomp_a);
  p_instance_b = COMP_GET_INSTANCE(hcomp_b);

  /* Note: Check configuration of only one comparator instance due to HAL COMP window functions ensuring
           symmetrical configuration of both comparators. */
  if (LL_COMP_IsLocked(p_instance_a) == 0UL)
  {
    LL_COMP_Enable(p_instance_a);
    LL_COMP_Enable(p_instance_b);

    /* Temporary variable to avoid undetermined processing order of volatile elements */
    uint32_t input_scaler_tmp = LL_COMP_IsInputScalerEnabled(p_instance_b);

    if ((LL_COMP_IsInputScalerEnabled(p_instance_a) != 0UL) || (input_scaler_tmp != 0UL))
    {
      /* Note: Stabilization delay of voltage scaler encompasses startup delay LL_COMP_DELAY_STARTUP_US */
      delay_startup_us = LL_COMP_DELAY_VOLTAGE_SCALER_STAB_US;
    }
    else
    {
      delay_startup_us = LL_COMP_DELAY_STARTUP_US;
    }

    /* Delay for COMP startup time. */
    COMP_DELAY_US(delay_startup_us);

    status = HAL_OK;
  }

  return status;
}
#endif /* USE_HAL_COMP_WINDOW_MODE */
#endif /* COMP_WINDOW_MODE_SUPPORT */

/**
  * @}
  */

/**
  * @}
  */

#endif /* USE_HAL_COMP_MODULE */
#endif /* COMP1 || COMP2 || COMP3 || COMP4 */
/**
  * @}
  */
